Repository: HUBT-Social/HUBT_Social_API
Catalog: Resources/SharedResource.*.resx
Languages: vi

source: Invalid information.
vi: Thông tin không hợp lệ.

source: Registration failed.
vi: Đăng ký thất bại.

# UnableToSendOTP
source: Unable to send OTP code.
vi: Không thể gửi mã OTP.

# RegistrationSuccess
source: Registration successful.
vi: Đăng ký thành công.

# StepOneVerificationSuccess
source: Step one verification successful.
vi: Bước xác thực một thành công.

source: Account locked.
vi: Tài khoản bị khóa.

source: Login not allowed.
vi: Không được phép đăng nhập.

# TwoFactorRequired
source: Two-factor authentication required.
vi: Cần xác thực hai yếu tố.

# InvalidCredentials
source: Invalid login credentials.
vi: Thông tin đăng nhập không hợp lệ.

# VerificationSuccess
source: Verification successful.
vi: Xác thực thành công.

source: OTP verification failed.
vi: Xác thực mã OTP không thành công.

source: Invalid language.
vi: Ngôn ngữ không hợp lệ.

# LanguageChanged
source: Language changed successfully.
vi: Đã thay đổi ngôn ngữ thành công.

# LanguageChangeFailed
source: Failed to change language.
vi: Thay đổi ngôn ngữ thất bại.

source: Invalid message data.
vi: Dữ liệu tin nhắn không hợp lệ

source: Message sent successfully.
vi: Tin nhắn đã được gửi thành công

source: Failed to send message.
vi: Gửi tin nhắn không thành công

# ChatRoomIdRequired
source: Chat room ID is required.
vi: ID phòng chat là bắt buộc

source: No messages found.
vi: Không tìm thấy tin nhắn nào

source: Message deleted successfully.
vi: Tin nhắn đã được xóa thành công

source: Failed to delete message.
vi: Xóa tin nhắn không thành công

# ChatRoomIdAndKeywordRequired
source: Chat room ID and keyword are required.
vi: ID phòng chat và từ khóa là bắt buộc

source: Messages found successfully.
vi: Tin nhắn đã được tìm thấy thành công

source: Image uploaded successfully.
vi: Ảnh đã được tải lên thành công

source: Failed to upload image.
vi: Tải ảnh lên không thành công

source: File uploaded successfully.
vi: Tập tin đã được tải lên thành công

source: Failed to upload file.
vi: Tải tập tin lên không thành công

# GroupNameRequired
source: Group name is required.
vi: Tên nhóm không được để trống

# GroupCreatedSuccessfully
source: Chat group created successfully.
vi: Nhóm chat đã được tạo thành công

# FailedToCreateGroup
source: Failed to create chat group.
vi: Không thể tạo nhóm chat

source: Group name updated successfully.
vi: Tên nhóm đã được cập nhật thành công

# FailedToUpdateGroup
source: Failed to update group name.
vi: Không thể cập nhật tên nhóm

# GroupDeletedSuccessfully
source: Chat group deleted successfully.
vi: Nhóm chat đã được xóa thành công

# FailedToDeleteGroup
source: Failed to delete chat group.
vi: Không thể xóa nhóm chat

# GroupNotFound
source: Chat group not found.
vi: Không tìm thấy nhóm chat

# UserAlreadyExists
source: User account already exists.
vi: Tài khoản người dùng đã tồn tại.

# UnableToStoreInDatabase
source: Unable to store in the database.
vi: Không thể lưu vào cơ sở dữ liệu.

# EmailVerificationCodeSubject
source: Email verification code.
vi: Mã xác minh email

source: Email cannot be empty.
vi: Email không được để trống.

# EmailUpdated
source: Email updated successfully.
vi: Email đã được cập nhật.

# EmailUpdateError
source: Failed to update email.
vi: Không thể cập nhật email

# PasswordCannotBeEmpty
source: Current password and new password cannot be empty.
vi: Mật khẩu hiện tại và mật khẩu mới không được để trống.

# PasswordUpdated
source: Password updated successfully.
vi: Mật khẩu đã được cập nhật.

# PasswordUpdateError
source: Error updating password.
vi: Có lỗi xảy ra khi cập nhật mật khẩu.

# NameUpdated
source: User name updated successfully.
vi: Tên người dùng đã được cập nhật.

# NameUpdateError
source: Error updating user name.
vi: Có lỗi xảy ra khi cập nhật tên.

# PhoneNumberUpdated
source: Phone number updated successfully.
vi: Số điện thoại đã được cập nhật.

# PhoneNumberUpdateError
source: Error updating phone number.
vi: Có lỗi xảy ra khi cập nhật số điện thoại.

# GenderUpdated
source: Gender updated successfully.
vi: Giới tính đã được cập nhật.

# GenderUpdateError
source: Error updating gender.
vi: Có lỗi xảy ra khi cập nhật giới tính.

# DateOfBirthUpdated
source: Date of birth updated successfully.
vi: Ngày sinh đã được cập nhật.

# DateOfBirthUpdateError
source: Error updating date of birth.
vi: Có lỗi xảy ra khi cập nhật ngày sinh.

# GeneralUpdateSuccess
source: User information updated successfully.
vi: Thông tin người dùng đã được cập nhật.

# GeneralUpdateError
source: Error updating user information.
vi: Có lỗi xảy ra khi cập nhật thông tin.

# CurrentPasswordAndUsernameCannotBeEmpty
source: Username and current password cannot be empty.
vi: Tên người dùng và mật khẩu hiện tại không được để trống.

# PasswordCorrect
source: Password is correct.
vi: Mật khẩu đúng.

# PasswordIncorrect
source: Password is incorrect.
vi: Mật khẩu không đúng.

source: Username cannot be empty.
vi: Tên người dùng không được để trống.

source: Invalid request.
vi: Yêu cầu không hợp lệ.

# OtpSent
source: OTP code sent.
vi: Mã OTP đã được gửi.

# OtpSendError
source: Error sending OTP code.
vi: Có lỗi xảy ra khi gửi mã OTP.

# OtpVerificationSuccess
source: OTP verification successful.
vi: Mã OTP xác thực thành công.

# OtpInvalid
source: OTP code is invalid.
vi: Mã OTP không hợp lệ.

source: User not found.
vi: Không tìm thấy người dùng

# UserInfoUpdatedSuccess
source: User information updated successfully.
vi: Thông tin đã được cập nhật

# UserInfoUpdateError
source: Error updating user information.
vi: Có lỗi xảy ra khi cập nhật thông tin.

# PasswordCheckEmptyError
source: Password cannot be empty
vi: Mật khẩu không được để trống.

# OtpVerifyEmptyError
source: OTP code cannot be empty.
vi: Mã xác thực không được để trống.

# TokenValid
source: Token is valid.
vi: Token hợp lệ.

source: Avatar Updated.
vi: Avatar đã được cập nhật.

# AvatarUpdateError
source: Error Updated Avatar.
vi: Cập nhật ảnh đại diện thất bại.
